package com.wyq.competition._11lanqiao;

/**
 * @program: algorithm-practice
 * @description: 七段码
 * @author: Mr.Wang
 * @create: 2021-04-29 20:06
 **/
public class _03七段码 {
    /*
    * 1.将数码管的七段进行全排列（用数字代表数码管字段,0代表a，1代表b,以此类推）然后将这7个数字的所有可能全部排列（从7个数字中取m（1<=m<=7）进行排列）列举出来。
      2.得到所有的取值情况，再判断每种情况构成的图是否连通，若连通，sum++
      3.进行排列时需要注意，一定要保证每个排列必须是递增或者递减,这样才能不重复，例如：012,021,210等等，它们都表示数码管中取出ABC这一种情况。
    * */
    /*
    * 难点：
    * 1.需要手写一个进行全排列的代码（之前写过，这个不是很难）
    * 2.使用到dfs进行深度搜索
    * 3.利用到了图相关的知识
    * */

}
